
import {nanoid} from 'nanoid'

import yarchuk from './img/yarchuk.png'
import img1 from './img/img1.jpg'
import img2 from './img/img2.jpg'
import img3 from './img/img3.jpg'
import video from './img/video.png'
import film from './img/film.png'
import podcast from './img/podcast.png'
import eventVideo from './img/eventVideo.png'
import eventImg from './img/eventImg.png'
import img4 from './img/img4.jpg'
import img5 from './img/img5.jpg'
import img6 from './img/img6.jpg'

export default [
    {
        type: 'post', // is needed for filtration
        style: 'post', // style, needed to decide what design of post is used
        imgs: [{
            photo: yarchuk,
            alt: 'Деякий опис фото необхідний для SEO сайту'
        }], // imgs - null or array of objects, can't be added if video link is added
        video: null, // null or link, if photos are added video can't be added
        title: "ДОРОГА КРІЗЬ ОБ'ЄКТИВ: ДЕ закінчується АСФАЛЬТ І ПОЧИНАЄТЬСЯ КІНО", 
        primText: "Справжня свобода не потребує сценарію, але вона завжди виглядає як ідеально вибудований кадр. Коли ти виходиш на трасу, світ навколо перестає бути просто декорацією — він стає живою стрічкою, де кожен оберт двигуна відбиває ритм монтажної склейки. Для байкера шлях — це процес, для кіношника — це візія. А на перетині цих світів народжується чиста естетика руху. У цьому стані зникає межа між реальністю та художньою вигадкою. Кожен відблиск західного сонця на баку мотоцикла стає природним фільтром, а шум зустрічного вітру перетворюється на ідеальний саундтрек, який не потребує додаткового зведення. Це момент, коли ти перестаєш бути просто спостерігачем і стаєш оператором власної долі, де замість штатива — міцні руки на кермі, а замість вибору локації — нескінченний горизонт. ",
        secText: "Тут немає місця фальшивим емоціям чи поганій грі, адже швидкість вимагає граничної чесності, так само як і об'єктив камери що фіксує найменшу деталь твого досвіду. Цей ресурс створений для тих, хто відчуває кінематограф у кожному кілометрі. Ми тут не просто обговорюємо залізо чи камери. Ми досліджуємо, як швидкість змінює сприйняття кадру, чому класичні байки стали символами епох у великому кіно і як зафіксувати драйв так, щоб глядач відчув запах паленої гуми крізь екран. Ми розбираємо техніку зйомки в екстремальних умовах, де вібрація мотора стає викликом для стабілізації, а зміна освітлення в тунелях — уроком з експозиції. Це простір для тих, хто знає, що найкращі історії розповідаються не словами, а рухом, світлом і ревом вихлопної системи.Вдягай екіп, перевіряй фокус. Попереду — довга ніч, порожня траса і нескінченний дубль, який неможливо повторити. Кожна мить на цій дорозі є унікальною, і наше завдання — не просто прожити її, а зберегти ту візуальну енергію, що виникає між теплим асфальтом і холодним склом лінзи. Світло виставлено, двигун прогрітий. Мотор! Камера! Поїхали!",
        //secText can be 'text' or ''
        terms: null, // null or terms obj (example below)
        date: '01.01.2026', // date the post was published
        pinned: false, // if the post was pinned by author it must be at the beginning of posts arr index depends on already pinned posts
        id: nanoid()
    },
    {
        type: 'post',
        style: 'post',  
        imgs: [{
            photo: yarchuk,
            alt: 'Деякий опис фото необхідний для SEO сайту'
        }],
        video: null,
        title: "ДОРОГА КРІЗЬ ОБ'ЄКТИВ: ДЕ закінчується АСФАЛЬТ І ПОЧИНАЄТЬСЯ КІНО", 
        primText: "Справжня свобода не потребує сценарію, але вона завжди виглядає як ідеально вибудований кадр. Коли ти виходиш на трасу, світ навколо перестає бути просто декорацією — він стає живою стрічкою, де кожен оберт двигуна відбиває ритм монтажної склейки. Для байкера шлях — це процес, для кіношника — це візія. А на перетині цих світів народжується чиста естетика руху. У цьому стані зникає межа між реальністю та художньою вигадкою. Кожен відблиск західного сонця на баку мотоцикла стає природним фільтром, а шум зустрічного вітру перетворюється на ідеальний саундтрек, який не потребує додаткового зведення. Це момент, коли ти перестаєш бути просто спостерігачем і стаєш оператором власної долі, де замість штатива — міцні руки на кермі, а замість вибору локації — нескінченний горизонт.",
        secText: '',
        terms: null,
        date: '01.01.2026',
        pinned: false,
        id: nanoid()
    },
    {
        type: 'post',
        style: 'post', 
        imgs: [{
            photo: yarchuk,
            alt: 'Деякий опис фото необхідний для SEO сайту'
        }],
        video: null,
        title: "ДОРОГА КРІЗЬ ОБ'ЄКТИВ: ДЕ закінчується АСФАЛЬТ І ПОЧИНАЄТЬСЯ КІНО", 
        primText: "Справжня свобода не потребує сценарію, але вона завжди виглядає як ідеально вибудований кадр. Коли ти виходиш на трасу, світ навколо перестає бути просто декорацією — він стає живою стрічкою, де кожен оберт двигуна відбиває ритм монтажної склейки. Для байкера шлях — це процес, для кіношника — це візія. А на перетині цих світів народжується чиста естетика руху. У цьому стані зникає межа між реальністю та художньою вигадкою. Кожен відблиск західного сонця на баку мотоцикла стає природним фільтром, а шум зустрічного вітру перетворюється на ідеальний саундтрек, який не потребує додаткового зведення. Це момент, коли ти перестаєш бути просто спостерігачем і стаєш оператором власної долі, де замість штатива — міцні руки на кермі, а замість вибору локації — нескінченний горизонт.",
        secText: "Тут немає місця фальшивим емоціям чи поганій грі, адже швидкість вимагає граничної чесності, так само як і об'єктив камери що фіксує найменшу деталь твого досвіду. Цей ресурс створений для тих, хто відчуває кінематограф у кожному кілометрі. Ми тут не просто обговорюємо залізо чи камери. Ми досліджуємо, як швидкість змінює сприйняття кадру, чому класичні байки стали символами епох у великому кіно і як зафіксувати драйв так, щоб глядач відчув запах паленої гуми крізь екран. Ми розбираємо техніку зйомки в екстремальних умовах, де вібрація мотора стає викликом для стабілізації, а зміна освітлення в тунелях — уроком з експозиції. Це простір для тих, хто знає, що найкращі історії розповідаються не словами, а рухом, світлом і ревом вихлопної системи.Вдягай екіп, перевіряй фокус. Попереду — довга ніч, порожня траса і нескінченний дубль, який неможливо повторити. Кожна мить на цій дорозі є унікальною, і наше завдання — не просто прожити її, а зберегти ту візуальну енергію, що виникає між теплим асфальтом і холодним склом лінзи. Світло виставлено, двигун прогрітий. Мотор! Камера! Поїхали!",
        terms: [
            {
                title: "Створити візуал", 
                descr: "Зробити фото або коротке відео (до 15 секунд), де ваш байк або елемент екіпірування представлений у кінематографічному стилі (особлива увага до світла, композиції та кольорокорекції)"
            },
            {
                title: "Опублікувати пост", 
                descr: "Розмістити роботу у своєму профілі з тегом нашої спільноти та коротким описом того, який фільм або режисер надихнув вас на цей кадр"
            },
            {
                title: "Використати хештег", 
                descr: "Обов’язково додати тег #MotoCinemaFocus під публікацією для ідентифікації вашої участі"
            },
            {
                title: "Бути підписаним",
                descr: "Перевірити наявність підписки на наш ресурс, де будуть оголошені результати"
            },
            {
                title: "Терміни", 
                descr: "Роботи приймаються до кінця поточного місяця; переможця буде визначено за критеріями художньої якості та технічного виконання"
            },
        ],
        date: '01.01.2026',
        pinned: false,
        id: nanoid()
    },
    {
        type: 'post',
        style: 'post',  
        imgs: [{
            photo: yarchuk,
            alt: 'Деякий опис фото необхідний для SEO сайту'
        }],
        video: null,
        title: "ДОРОГА КРІЗЬ ОБ'ЄКТИВ: ДЕ закінчується АСФАЛЬТ І ПОЧИНАЄТЬСЯ КІНО", 
        primText: "Справжня свобода не потребує сценарію, але вона завжди виглядає як ідеально вибудований кадр. Коли ти виходиш на трасу, світ навколо перестає бути просто декорацією — він стає живою стрічкою, де кожен оберт двигуна відбиває ритм монтажної склейки. Для байкера шлях — це процес, для кіношника — це візія. А на перетині цих світів народжується чиста естетика руху. У цьому стані зникає межа між реальністю та художньою вигадкою. Кожен відблиск західного сонця на баку мотоцикла стає природним фільтром, а шум зустрічного вітру перетворюється на ідеальний саундтрек, який не потребує додаткового зведення. Це момент, коли ти перестаєш бути просто спостерігачем і стаєш оператором власної долі, де замість штатива — міцні руки на кермі, а замість вибору локації — нескінченний горизонт.",
        secText: '',
        terms: [
            {
                title: "Створити візуал", 
                descr: "Зробити фото або коротке відео (до 15 секунд), де ваш байк або елемент екіпірування представлений у кінематографічному стилі (особлива увага до світла, композиції та кольорокорекції)"
            },
            {
                title: "Опублікувати пост", 
                descr: "Розмістити роботу у своєму профілі з тегом нашої спільноти та коротким описом того, який фільм або режисер надихнув вас на цей кадр"
            },
            {
                title: "Використати хештег", 
                descr: "Обов’язково додати тег #MotoCinemaFocus під публікацією для ідентифікації вашої участі"
            },
            {
                title: "Бути підписаним",
                descr: "Перевірити наявність підписки на наш ресурс, де будуть оголошені результати"
            },
            {
                title: "Терміни", 
                descr: "Роботи приймаються до кінця поточного місяця; переможця буде визначено за критеріями художньої якості та технічного виконання"
            },
        ],
        date: '01.01.2026',
        pinned: false,
        id: nanoid()
    },
    {
        type: 'post',
        style: 'post',  
        imgs: [{
            photo: img1,
            alt: 'Деякий опис фото необхідний для SEO сайту'
        }, {
            photo: img2,
            alt: 'Деякий опис фото необхідний для SEO сайту'
        }, {
            photo: img3,
            alt: 'Деякий опис фото необхідний для SEO сайту'
        }],
        video: null,
        title: "Еволюція кастому: Від креслення до першого виїзду" ,
        primText: "Кожна подорож починається з ідеї, але справжня магія відбувається в майстерні, де холодний метал поступово набуває форми. У цьому слайдері ми зібрали ключові етапи створення нашого останнього проекту, щоб ви могли зазирнути за лаштунки процесу. Гортайте вбік, щоб побачити шлях від перших ескізів на папері та зварювання рами до фінального полірування хрому. Кожен кадр — це десятки годин роботи, пошуку ідеальної геометрії та боротьби за кожен міліметр ергономіки. Це не просто фотографії механізмів, це фіксація того моменту, коли інженерний розрахунок стає мистецтвом, а набір запчастин перетворюється на об’єкт із власним характером і душею. Який етап збірки здається вам найскладнішим? Пишіть свою думку в коментарях.",
        terms: null,
        date: '01.01.2026',
        pinned: false,
        id: nanoid()
    },
    {
        type: 'post',
        style: 'post',  
        imgs: [{
            photo: img1,
            alt: 'Деякий опис фото необхідний для SEO сайту'
        }, {
            photo: img2,
            alt: 'Деякий опис фото необхідний для SEO сайту'
        }, {
            photo: img3,
            alt: 'Деякий опис фото необхідний для SEO сайту'
        }],
        video: null,
        title: "КАДР НА ШВИДКОСТІ: конкурс ДЛЯ ТИХ, ХТО БАЧИТЬ ДРАЙВ" ,
        primText: "Оголошується старт творчого конкурсу для тих, хто бачить естетику в кожній деталі свого мотоцикла та екіпірування. Мета — перетворити техніку на об'єкт кіномистецтва.",
        terms: [
            {
                title: "Створити візуал", 
                descr: "Зробити фото або коротке відео (до 15 секунд), де ваш байк або елемент екіпірування представлений у кінематографічному стилі (особлива увага до світла, композиції та кольорокорекції)"
            },
            {
                title: "Опублікувати пост", 
                descr: "Розмістити роботу у своєму профілі з тегом нашої спільноти та коротким описом того, який фільм або режисер надихнув вас на цей кадр"
            },
            {
                title: "Використати хештег", 
                descr: "Обов’язково додати тег #MotoCinemaFocus під публікацією для ідентифікації вашої участі"
            },
            {
                title: "Бути підписаним",
                descr: "Перевірити наявність підписки на наш ресурс, де будуть оголошені результати"
            },
            {
                title: "Терміни", 
                descr: "Роботи приймаються до кінця поточного місяця; переможця буде визначено за критеріями художньої якості та технічного виконання"
            },
        ],
        date: '01.01.2026',
        pinned: false,
        id: nanoid()
    },
    {
        type: 'post',
        style: 'post', 
        imgs: null,
        video: video,
        title: "ДОРОГА КРІЗЬ ОБ'ЄКТИВ: ДЕ закінчується АСФАЛЬТ І ПОЧИНАЄТЬСЯ КІНО",
        primText: "Справжня свобода не потребує сценарію, але вона завжди виглядає як ідеально вибудований кадр. Коли ти виходиш на трасу, світ навколо перестає бути просто декорацією — він стає живою стрічкою, де кожен оберт двигуна відбиває ритм монтажної склейки. Для байкера шлях — це процес, для кіношника — це візія. А на перетині цих світів народжується чиста естетика руху.У цьому стані зникає межа між реальністю та художньою вигадкою. Кожен відблиск західного сонця на баку мотоцикла стає природним фільтром, а шум зустрічного вітру перетворюється на ідеальний саундтрек, який не потребує додаткового зведення.", 
        terms: null,
        date: '01.01.2026',
        pinned: false,
        id: nanoid()
    },
    {
        type: 'post',
        style: 'post', 
        imgs: null,
        video: video,
        title: "ДОРОГА КРІЗЬ ОБ'ЄКТИВ: ДЕ закінчується АСФАЛЬТ І ПОЧИНАЄТЬСЯ КІНО",
        primText: "Справжня свобода не потребує сценарію, але вона завжди виглядає як ідеально вибудований кадр. Коли ти виходиш на трасу, світ навколо перестає бути просто декорацією — він стає живою стрічкою, де кожен оберт двигуна відбиває ритм монтажної склейки. Для байкера шлях — це процес, для кіношника — це візія. А на перетині цих світів народжується чиста естетика руху.У цьому стані зникає межа між реальністю та художньою вигадкою. Кожен відблиск західного сонця на баку мотоцикла стає природним фільтром, а шум зустрічного вітру перетворюється на ідеальний саундтрек, який не потребує додаткового зведення.", 
        terms: [
            {
                title: "Створити візуал", 
                descr: "Зробити фото або коротке відео (до 15 секунд), де ваш байк або елемент екіпірування представлений у кінематографічному стилі (особлива увага до світла, композиції та кольорокорекції)"
            },
            {
                title: "Опублікувати пост", 
                descr: "Розмістити роботу у своєму профілі з тегом нашої спільноти та коротким описом того, який фільм або режисер надихнув вас на цей кадр"
            },
            {
                title: "Використати хештег", 
                descr: "Обов’язково додати тег #MotoCinemaFocus під публікацією для ідентифікації вашої участі"
            },
            {
                title: "Бути підписаним",
                descr: "Перевірити наявність підписки на наш ресурс, де будуть оголошені результати"
            },
            {
                title: "Терміни", 
                descr: "Роботи приймаються до кінця поточного місяця; переможця буде визначено за критеріями художньої якості та технічного виконання"
            },
        ],
        date: '01.01.2026',
        pinned: false,
        id: nanoid()
    },
    {
        type: 'film',
        style: 'film', 
        video: film, // in this case only video
        title: "Мотокульт",
        primText: "Справжня свобода не потребує сценарію, але вона завжди виглядає як ідеально вибудований кадр. Коли ти виходиш на трасу, світ навколо перестає бути просто декорацією — він стає живою стрічкою, де кожен оберт двигуна відбиває ритм монтажної склейки. Для байкера шлях — це процес, для кіношника — це візія.",
        secText: " А на перетині цих світів народжується чиста естетика руху. У цьому стані зникає межа між реальністю та художньою вигадкою. Кожен відблиск західного сонця на баку мотоцикла стає природним фільтром, а шум зустрічного вітру перетворюється на ідеальний саундтрек, який не потребує додаткового зведення. Це момент, коли ти перестаєш бути просто спостерігачем і стаєш оператором власної долі, де замість штатива — міцні руки на кермі, а замість вибору локації — нескінченний горизонт. Тут немає місця фальшивим емоціям чи поганій грі, адже швидкість вимагає граничної чесності, так само як і об'єктив камери, що фіксує найменшу деталь твого досвіду. Цей ресурс створений для тих, хто відчуває кінематограф у кожному кілометрі. Ми тут не просто обговорюємо залізо чи камери. Ми досліджуємо, як швидкість змінює сприйняття кадру, чому класичні байки стали символами епох у великому кіно і як зафіксувати драйв так, щоб глядач відчув запах паленої гуми крізь екран. Ми розбираємо техніку зйомки в екстремальних умовах, де вібрація мотора стає викликом для стабілізації, а зміна освітлення в тунелях — уроком з експозиції. Це простір для тих, хто знає, що найкращі історії розповідаються не словами, а рухом, світлом і ревом вихлопної системи. Вдягай екіп, перевіряй фокус. Попереду — довга ніч, порожня траса і нескінченний дубль, який неможливо повторити. Кожна мить на цій дорозі є унікальною, і наше завдання — не просто прожити її, а зберегти ту візуальну енергію, що виникає між теплим асфальтом і холодним склом лінзи. Світло виставлено, двигун прогрітий. Мотор! Камера! Поїхали!", 
        date: '01.01.2026',
        pinned: false,
        id: nanoid()
    },
    {
        type: 'film',
        style: 'film', 
        video: film, // in this case only video
        title: "Мотокульт",
        primText: "Справжня свобода не потребує сценарію, але вона завжди виглядає як ідеально вибудований кадр. Коли ти виходиш на трасу, світ навколо перестає бути просто декорацією — він стає живою стрічкою, де кожен оберт двигуна відбиває ритм монтажної склейки. Для байкера шлях — це процес, для кіношника — це візія.",
        date: '01.01.2026',
        pinned: false,
        id: nanoid()
    },
    {
        type: 'podcast',
        style: 'podcast', 
        video: podcast, // in this case only video
        title: 'Подкаст мотокультура',
        primText: "Це подкаст про рух — не лише фізичний, а й внутрішній. Тут дорога стає сценою, а камера — способом бачити глибше. Ми говоримо про те, як швидкість змінює сприйняття, як народжується візуальний сторітелінг у русі та чому іноді найкращі кадри трапляються там, де закінчується маршрут. У кожному епізоді — розмови з фотографами, відеографами та креаторами, які ловлять драйв у кадрі. Про помилки, натхнення, ризик і моменти, які неможливо повторити, але можна відчути знову через об’єктив. Це місце для тих, хто не просто дивиться — а бачить.",
        date: '01.01.2026',
        pinned: false,
        id: nanoid()
    },
    {
        type: 'event',
        style: 'event',
        video: eventVideo, // or arr of 2+ img, arr of 1 img
        title: 'Механічна душа',
        primText: "Ця концепція фокусується на інженерному аспекті та крафтовій культурі, де головною темою стає процес створення металевого шедевра з нуля. Подія розгортається в атмосфері діючої кастом-майстерні, де запах мастила та заліза змішується з кінематографічним досвідом, а глядачі спостерігають на великому екрані за кожною деталлю складання двигуна. Програма заходу об’єднує перегляд документальних стрічок про видатних конструкторів із живою експозицією розібраних вузлів мотоцикла, що дозволяє гостям буквально доторкнутися до кінореальності. Це свято технічного перфекціонізму, де кожен кадр синхронізований із виставкою реальних прототипів, підкреслюючи зв'язок між ідеєю дизайнера та її фізичним втіленням у металі.",
        eventData: {
            location: 'Хрещатик',
            deadline: '01.01.2030', // No later than eventDate
            eventDate: '01.02.2030 14:00'
        },
        date: '01.01.2026',
        pinned: false,
        id: nanoid()
    },
    {
        type: 'event',
        style: 'event',
        imgs: [{
            photo: eventImg,
            alt: 'фотографія Ярослава'
        }], // or arr of 2+ img, 1 video
        title: 'Механічна душа',
        primText: "Ця концепція фокусується на інженерному аспекті та крафтовій культурі, де головною темою стає процес створення металевого шедевра з нуля. Подія розгортається в атмосфері діючої кастом-майстерні, де запах мастила та заліза змішується з кінематографічним досвідом, а глядачі спостерігають на великому екрані за кожною деталлю складання двигуна. Програма заходу об’єднує перегляд документальних стрічок про видатних конструкторів із живою експозицією розібраних вузлів мотоцикла, що дозволяє гостям буквально доторкнутися до кінореальності. Це свято технічного перфекціонізму, де кожен кадр синхронізований із виставкою реальних прототипів, підкреслюючи зв'язок між ідеєю дизайнера та її фізичним втіленням у металі.",
        eventData: {
            location: 'Хрещатик',
            deadline: '01.01.2023', // No later than eventDate
            eventDate: '01.02.2030 14:00'
        },
        date: '01.01.2026',
        pinned: false,
        id: nanoid()
    },
    {
        type: 'event',
        style: 'event',
        imgs: [
            {
                photo: img4,
                alt: 'фотографія Ярослава'
            },
            {
                photo: img5,
                alt: 'фотографія Ярослава'
            },
            {
                photo: img6,
                alt: 'фотографія Ярослава'
            }
        ], // or arr of 2+ img, 1 video
        title: 'Сталевий пульс',
        primText: "Ця подія присвячена синергії звуку та вібрації, де акцент робиться на аудіовізуальному сприйнятті байка як живого організму. Локація облаштовується у форматі акустичного залу, де перед початком кожного фільму проводиться демонстрація звучання різних типів двигунів — від низькочастотного рокоту опозитних моторів до металевого дзвону форсованих спортивних агрегатів. Глядачі занурюються в історію кінематографа через призму звукового дизайну, розбираючи, як саме ревіння мотора створює напругу та динаміку в культових сценах погонь. Програма включає короткометражні стрічки про подорожі пустелями, де звук вітру та мотора є єдиним супроводом, що дозволяє аудиторії відчути стан глибокої дорожньої медитації та єднання з машиною.",
        eventData: {
            location: 'Хрещатик',
            deadline: '01.01.2023', // No later than eventDate
            eventDate: '01.02.2030 14:00'
        },
        date: '01.01.2026',
        pinned: false,
        id: nanoid()
    }
]