
import yarchuk from './img/yarchuk.png'
import img1 from './img/img1.jpg'
import img2 from './img/img2.jpg'
import img3 from './img/img3.jpg'
import video from './img/video.png'

export default [
    {
        type: 'post', 
        imgs: [{
            photo: yarchuk,
            alt: 'Деякий опис фото необхідний для SEO сайту'
        }],
        video: null,
        title: "ДОРОГА КРІЗЬ ОБ'ЄКТИВ: ДЕ закінчується АСФАЛЬТ І ПОЧИНАЄТЬСЯ КІНО", 
        primText: "Справжня свобода не потребує сценарію, але вона завжди виглядає як ідеально вибудований кадр. Коли ти виходиш на трасу, світ навколо перестає бути просто декорацією — він стає живою стрічкою, де кожен оберт двигуна відбиває ритм монтажної склейки. Для байкера шлях — це процес, для кіношника — це візія. А на перетині цих світів народжується чиста естетика руху. У цьому стані зникає межа між реальністю та художньою вигадкою. Кожен відблиск західного сонця на баку мотоцикла стає природним фільтром, а шум зустрічного вітру перетворюється на ідеальний саундтрек, який не потребує додаткового зведення. Це момент, коли ти перестаєш бути просто спостерігачем і стаєш оператором власної долі, де замість штатива — міцні руки на кермі, а замість вибору локації — нескінченний горизонт. Тут немає місця фальшивим емоціям чи поганій грі, адже швидкість вимагає граничної чесності, так само як і об'єктив камери",
        secText: "що фіксує найменшу деталь твого досвіду. Цей ресурс створений для тих, хто відчуває кінематограф у кожному кілометрі. Ми тут не просто обговорюємо залізо чи камери. Ми досліджуємо, як швидкість змінює сприйняття кадру, чому класичні байки стали символами епох у великому кіно і як зафіксувати драйв так, щоб глядач відчув запах паленої гуми крізь екран. Ми розбираємо техніку зйомки в екстремальних умовах, де вібрація мотора стає викликом для стабілізації, а зміна освітлення в тунелях — уроком з експозиції. Це простір для тих, хто знає, що найкращі історії розповідаються не словами, а рухом, світлом і ревом вихлопної системи.Вдягай екіп, перевіряй фокус. Попереду — довга ніч, порожня траса і нескінченний дубль, який неможливо повторити. Кожна мить на цій дорозі є унікальною, і наше завдання — не просто прожити її, а зберегти ту візуальну енергію, що виникає між теплим асфальтом і холодним склом лінзи. Світло виставлено, двигун прогрітий. Мотор! Камера! Поїхали!",
        terms: null
    },
    {
        type: 'post', 
        imgs: [{
            photo: img1,
            alt: 'Деякий опис фото необхідний для SEO сайту'
        }, {
            photo: img2,
            alt: 'Деякий опис фото необхідний для SEO сайту'
        }, {
            photo: img3,
            alt: 'Деякий опис фото необхідний для SEO сайту'
        }],
        video: null,
        title: "КАДР НА ШВИДКОСТІ: конкурс ДЛЯ ТИХ, ХТО БАЧИТЬ ДРАЙВ" ,
        primText: "Оголошується старт творчого конкурсу для тих, хто бачить естетику в кожній деталі свого мотоцикла та екіпірування. Мета — перетворити техніку на об'єкт кіномистецтва.",
        terms: [
            {
                title: "Створити візуал", 
                descr: "Зробити фото або коротке відео (до 15 секунд), де ваш байк або елемент екіпірування представлений у кінематографічному стилі (особлива увага до світла, композиції та кольорокорекції)"
            },
            {
                title: "Опублікувати пост", 
                descr: "Розмістити роботу у своєму профілі з тегом нашої спільноти та коротким описом того, який фільм або режисер надихнув вас на цей кадр"
            },
            {
                title: "Використати хештег", 
                descr: "Обов’язково додати тег #MotoCinemaFocus під публікацією для ідентифікації вашої участі"
            },
            {
                title: "Бути підписаним",
                descr: "Перевірити наявність підписки на наш ресурс, де будуть оголошені результати"
            },
            {
                title: "Терміни", 
                descr: "Роботи приймаються до кінця поточного місяця; переможця буде визначено за критеріями художньої якості та технічного виконання"
            },
        ]
    },
    {
        type: 'post',
        imgs: null,
        video: video, // or arr of 2+ img, arr of 1 img
        title: "ДОРОГА КРІЗЬ ОБ'ЄКТИВ: ДЕ закінчується АСФАЛЬТ І ПОЧИНАЄТЬСЯ КІНО",
        primText: "Справжня свобода не потребує сценарію, але вона завжди виглядає як ідеально вибудований кадр. Коли ти виходиш на трасу, світ навколо перестає бути просто декорацією — він стає живою стрічкою, де кожен оберт двигуна відбиває ритм монтажної склейки. Для байкера шлях — це процес, для кіношника — це візія. А на перетині цих світів народжується чиста естетика руху.У цьому стані зникає межа між реальністю та художньою вигадкою. Кожен відблиск західного сонця на баку мотоцикла стає природним фільтром, а шум зустрічного вітру перетворюється на ідеальний саундтрек, який не потребує додаткового зведення.",
        secText: "Це момент, коли ти перестаєш бути просто спостерігачем і стаєш оператором власної долі, де замість штатива — міцні руки на кермі, а замість вибору локації — нескінченний горизонт. Тут немає місця фальшивим емоціям чи поганій грі, адже швидкість вимагає граничної чесності, так само як і об'єктив камери що фіксує найменшу деталь твого досвіду. Цей ресурс створений для тих, хто відчуває кінематограф у кожному кілометрі. Ми тут не просто обговорюємо залізо чи камери. Ми досліджуємо, як швидкість змінює сприйняття кадру, чому класичні байки стали символами епох у великому кіно і як зафіксувати драйв так, щоб глядач відчув запах паленої гуми крізь екран. Ми розбираємо техніку зйомки в екстремальних умовах, де вібрація мотора стає викликом для стабілізації, а зміна освітлення в тунелях — уроком з експозиції. Це простір для тих, хто знає, що найкращі історії розповідаються не словами, а рухом, світлом і ревом вихлопної системи. Вдягай екіп, перевіряй фокус. Попереду — довга ніч, порожня траса і нескінченний дубль, який неможливо повторити. Кожна мить на цій дорозі є унікальною, і наше завдання — не просто прожити її, а зберегти ту візуальну енергію, що виникає між теплим асфальтом і холодним склом лінзи. Світло виставлено, двигун прогрітий. Мотор! Камера! Поїхали!", 
        terms: null
    }
]