import './FilmPost.sass'

import img from './img/video.png'

export default function Film() {
    return (
        <article className="film-post">
            <h2 className="film-post__title">
                Мотокульт
            </h2>
            <div className="grid__film-post">
                <p className="film-post__main-text">
                    Справжня свобода не потребує сценарію, але вона завжди виглядає як ідеально вибудований кадр. Коли ти виходиш на трасу, світ навколо перестає бути просто декорацією — він стає живою стрічкою, де кожен оберт двигуна відбиває ритм монтажної склейки. Для байкера шлях — це процес, для кіношника — це візія. А на перетині цих світів 
                </p>
                <div className="film-post__img">
                    <img src={img} alt="Ярослав у студії на мотоциклі" />
                </div>
                <p className="film-post__additional-text">
                    народжується чиста естетика руху. У цьому стані зникає межа між реальністю та художньою вигадкою. Кожен відблиск західного сонця на баку мотоцикла стає природним фільтром, а шум зустрічного вітру перетворюється на ідеальний саундтрек, який не потребує додаткового зведення. Це момент, коли ти перестаєш бути просто спостерігачем і стаєш оператором власної долі, де замість штатива — міцні руки на кермі, а замість вибору локації — нескінченний горизонт. Тут немає місця фальшивим емоціям чи поганій грі, адже швидкість вимагає граничної чесності, так само як і об'єктив камери, що фіксує найменшу деталь твого досвіду. Цей ресурс створений для тих, хто відчуває кінематограф у кожному кілометрі. Ми тут не просто обговорюємо залізо чи камери. Ми досліджуємо, як швидкість змінює сприйняття кадру, чому класичні байки стали символами епох у великому кіно і як зафіксувати драйв так, щоб глядач відчув запах паленої гуми крізь екран. Ми розбираємо техніку зйомки в екстремальних умовах, де вібрація мотора стає викликом для стабілізації, а зміна освітлення в тунелях — уроком з експозиції. Це простір для тих, хто знає, що найкращі історії розповідаються не словами, а рухом, світлом і ревом вихлопної системи.
                    Вдягай екіп, перевіряй фокус. Попереду — довга ніч, порожня траса і нескінченний дубль, який неможливо повторити. Кожна мить на цій дорозі є унікальною, і наше завдання — не просто прожити її, а зберегти ту візуальну енергію, що виникає між теплим асфальтом і холодним склом лінзи. Світло виставлено, двигун прогрітий. Мотор! Камера! Поїхали!
                </p>
            </div>
        </article>
    )
}